[
  {
    "name": "Welcome back to my father's vegetable garden.",
    "trans": [
      "欢迎再次来到我父亲的菜园"
    ],
    "usphone": "ˈwɛlkəm ˌbæk tə maɪ ˈfɑðərz ˈvɛdʒtəbl ˈɡɑrdn",
    "ukphone": "ˈwɛlkəm ˌbæk tə maɪ ˈfɑːðəz ˈvɛdʒtəbəl ˈɡɑːdn"
  },
  {
    "name": "We just got back from a cruise.",
    "trans": [
      "我们刚从游轮回来"
    ],
    "usphone": "wi dʒʌst ɡɑt bæk frəm ə kruːz",
    "ukphone": "wiː dʒʌst ɡɒt bæk frəm ə kruːz"
  },
  {
    "name": "It was a six-day, five-night trip with my mom and dad.",
    "trans": [
      "6天5夜和我妈妈我爸爸在一起"
    ],
    "usphone": "ɪt wʌz ə sɪks-deɪ faɪv-naɪt trɪp wɪð maɪ mɑm ənd dæd",
    "ukphone": "ɪt wɒz ə sɪks-deɪ faɪv-naɪt trɪp wɪð maɪ mɒm ənd dæd"
  },
  {
    "name": "It's a big year for my father—he's turning eighty.",
    "trans": [
      "因为今年对我父亲来说是个大日子，80岁"
    ],
    "usphone": "ɪts ə bɪɡ jɪr fər maɪ ˈfɑðər — hiz ˈtɜrnɪŋ ˈeɪti",
    "ukphone": "ɪts ə bɪɡ jɪə fə maɪ ˈfɑːðə — hiːz ˈtɜːnɪŋ ˈeɪti"
  },
  {
    "name": "Turning eighty is a big deal in China.",
    "trans": [
      "在中国，80岁生日是件大事"
    ],
    "usphone": "ˈtɜrnɪŋ ˈeɪti z ə bɪɡ dil ɪn ˈtʃaɪnə",
    "ukphone": "ˈtɜːnɪŋ ˈeɪti ɪz ə bɪɡ diːl ɪn ˈtʃaɪnə"
  },
  {
    "name": "So I wanted to try something new.",
    "trans": [
      "所以我想做些新的尝试"
    ],
    "usphone": "soʊ aɪ ˈwɑntəd tə traɪ ˈsʌmθɪŋ nuː",
    "ukphone": "səʊ aɪ ˈwɒntɪd tə traɪ ˈsʌmθɪŋ njuː"
  },
  {
    "name": "My parents had never been abroad before.",
    "trans": [
      "因为我爸爸妈妈从来没出过国"
    ],
    "usphone": "maɪ ˈpɛrənts həd ˈnɛvər bɪn əˈbrɔːd bɪˈfɔr",
    "ukphone": "maɪ ˈpeərənts hæd ˈnɛvə biːn əˈbrɔːd bɪˈfɔː"
  },
  {
    "name": "I wanted to show them the world, so I took them on a cruise.",
    "trans": [
      "我带他们上了游轮，见识一下新鲜事物"
    ],
    "usphone": "aɪ ˈwɑntəd tə ʃoʊ ðɛm ðə wɜːrld, soʊ aɪ tʊk ðɛm ɑn ə kruːz",
    "ukphone": "aɪ ˈwɒntɪd tə ʃəʊ ðɛm ðə wɜːld, səʊ aɪ tʊk ðɛm ɒn ə kruːz"
  },
  {
    "name": "I remember watching 'Journey to the West' at our neighbor's house as a child.",
    "trans": [
      "我还记得小时候我和哥哥经常去邻居家看《西游记》"
    ],
    "usphone": "aɪ rɪˈmɛmbər ˈwɑtʃɪŋ ˈdʒɜrni tə ðə wɛst æt ˈaʊr ˈneɪbərz haʊs æz ə tʃaɪld",
    "ukphone": "aɪ rɪˈmɛmbə ˈwɒtʃɪŋ ˈdʒɜːni tə ðə wɛst æt ˈaʊə ˈneɪbəz haʊs æz ə tʃaɪld"
  },
  {
    "name": "the Monkey King.",
    "trans": [
      "美猴王"
    ],
    "usphone": "ðə ˈmʌŋki kɪŋ",
    "ukphone": "ðə ˈmʌŋki kɪŋ"
  },
  {
    "name": "My parents worked very hard and saved up a lot of money.",
    "trans": [
      "我的爸爸和妈妈他们努力工作攒了好多钱"
    ],
    "usphone": "maɪ ˈpɛrənts wɜrkt ˈvɛri hɑrd ənd seɪvd ʌp ə lɑt əv ˈmʌni",
    "ukphone": "maɪ ˈpeərənts wɜːkt ˈvɛri hɑːd ənd seɪvd ʌp ə lɒt əv ˈmʌni"
  },
  {
    "name": "They bought a 14-inch color TV for 1,400 yuan, if I remember correctly.",
    "trans": [
      "如果没记错的话他们花了1400元人民币买了14寸彩电"
    ],
    "usphone": "ðeɪ bɔt ə ˌfɔrˈtin ɪntʃ ˈkʌlər ˌtiˈvi fɔr ˌwʌn ˈθaʊzənd ˌfɔr ˈhʌndrəd juˈɑn, ɪf aɪ rɪˈmɛmbər kəˈrɛktli",
    "ukphone": "ðeɪ bɔːt ə ˌfɔːˈtiːn ɪntʃ ˈkʌlə ˌtiːˈviː fə ˌwʌn ˈθaʊzənd ˌfɔː ˈhʌndrəd juˈæn, ɪf aɪ rɪˈmembə kəˈrektli"
  },
  {
    "name": "Those are beautiful memories.",
    "trans": [
      "回忆还是很美好"
    ],
    "usphone": "ðoʊz ɑr ˈbjutəfəl ˈmɛməriz",
    "ukphone": "ðəʊz ɑː ˈbjuːtɪfəl ˈmeməriz"
  },
  {
    "name": "Filial piety is deeply important in China.",
    "trans": [
      "在中国我们讲孝道"
    ],
    "usphone": "ˈfɪliəl ˈpaɪəti ɪz ˈdipli ɪmˈpɔrtənt ɪn ˈtʃaɪnə",
    "ukphone": "ˈfɪliəl ˈpaɪəti ɪz ˈdiːpli ɪmˈpɔːtənt ɪn ˈtʃaɪnə"
  },
  {
    "name": "As they grow old, we grow up and become parents ourselves.",
    "trans": [
      "当他们变老，我们长大成为爸爸妈妈"
    ],
    "usphone": "æz ðeɪ ɡroʊ oʊld, wi ɡroʊ ʌp ənd bɪˈkʌm ˈpɛrənts ˌaʊərˈsɛlvz",
    "ukphone": "æz ðeɪ ɡrəʊ əʊld, wi ɡrəʊ ʌp ənd bɪˈkʌm ˈpeərənts ˌaʊəˈselvz"
  },
  {
    "name": "We learned by watching how they cared for our elders.",
    "trans": [
      "我们小时候看他们如何对待老人，我们学到了"
    ],
    "usphone": "wi lɜrnd baɪ ˈwɑtʃɪŋ haʊ ðeɪ kɛrd fər ˈaʊr ˈɛldərz",
    "ukphone": "wiː lɜːnd baɪ ˈwɒtʃɪŋ haʊ ðeɪ keəd fə ˈaʊə ˈeldəz"
  },
  {
    "name": "Now it's our turn to take care of them.",
    "trans": [
      "当他们老了，我们需要照顾他们"
    ],
    "usphone": "naʊ ɪts ˈaʊər tɜrn tə teɪk kɛr əv ðɛm",
    "ukphone": "naʊ ɪts ˈaʊə tɜːn tə teɪk keər əv ðem"
  },
  {
    "name": "Like letting them see the world or try new foods.",
    "trans": [
      "比如出国看看或尝试美食"
    ],
    "usphone": "laɪk ˈlɛtɪŋ ðɛm si ðə wɜrld ɔr traɪ nu fudz",
    "ukphone": "laɪk ˈletɪŋ ðem siː ðə wɜːld ɔː traɪ njuː fuːdz"
  },
  {
    "name": "Passing love from one generation to the next.",
    "trans": [
      "一代又一代传给孩子"
    ],
    "usphone": "ˈpæsɪŋ lʌv frəm wʌn ˌdʒɛnəˈreɪʃən tə ðə nɛkst",
    "ukphone": "ˈpɑːsɪŋ lʌv frəm wʌn ˌdʒenəˈreɪʃən tə ðə nekst"
  },
  {
    "name": "Someday, I'll get to live the kind of life he lives now.",
    "trans": [
      "迟早我也能过上像他现在一样的生活"
    ],
    "usphone": "ˈsʌmdeɪ aɪl ɡɛt tə lɪv ðə kaɪnd əv laɪf hi lɪvz naʊ",
    "ukphone": "ˈsʌmdeɪ aɪl ɡet tə lɪv ðə kaɪnd əv laɪf hiː lɪvz naʊ"
  },
  {
    "name": "Kung Fu Panda—what an amazing father.",
    "trans": [
      "功夫熊猫——了不起的父亲"
    ],
    "usphone": "ˈkʌŋ fu ˈpændə — wʌt ən əˈmeɪzɪŋ ˈfɑðər",
    "ukphone": "ˈkʌŋ fuː ˈpændə — wɒt ən əˈmeɪzɪŋ ˈfɑːðə"
  },
  {
    "name": "Wishing you peace and blessings.",
    "trans": [
      "平安"
    ],
    "usphone": "ˈwɪʃɪŋ ju pis ənd ˈblɛsɪŋz",
    "ukphone": "ˈwɪʃɪŋ juː piːs ənd ˈblesɪŋz"
  }
]